Repository: BenCastricum/scummvm
Catalog: engines/scumm/*.po
Languages: nl_nl

source: Putt-Putt Saves the Zoo
nl_nl: Putt-Putt 1: Putt-Putt redt de Zoo

source: Putt-Putt Travels Through Time
nl_nl: Putt-Putt 2: De Reis Door De Tijd

source: Putt-Putt Enters the Race
nl_nl: Putt-Putt 3: De Autostad 500

source: Putt-Putt Joins the Circus
nl_nl: Putt-Putt 4: In het Circus

source: Putt-Putt and Pep's Balloon-O-Rama
nl_nl: Putt-Putt en Peps Ballon-O-Rama

source: Putt-Putt and Pep's Dog on a Stick
nl_nl: Putt-Putt en Peps Springparadijs

source: Freddi Fish 1: The Case of the Missing Kelp Seeds
nl_nl: Freddi Fish 1: Het Verhaal van de Verdwenen Zeewierzaadjes

source: Freddi Fish 2: The Case of the Haunted Schoolhouse
nl_nl: Freddi Fish 2: Het Mysterie van de Spoken op School

source: Freddi Fish 3: The Case of the Stolen Conch Shell
nl_nl: Freddi Fish 3: De Zaak van de Gestolen Trompetschelp

source: Freddi Fish 4: The Case of the Hogfish Rustlers of Briny Gulch
nl_nl: Freddi Fish 4: De Kidnapping in de Zilte Zee

source: Freddi Fish 5: The Case of the Creature of Coral Cove
nl_nl: Freddi Fish 5: De Zaak Zeemonster

source: Freddi Fish and Luther's Maze Madness
nl_nl: Freddi Fish en Loebas' Dolle Doolhof

source: Freddi Fish and Luther's Water Worries
nl_nl: Freddi Fish en Loebas' Water Werken

source: Freddi Fish's One-Stop Fun Shop
nl_nl: Freddi Fish' Knutselbox

source: Pajama Sam 1: No Need to Hide When It's Dark Outside
nl_nl: Pajama Sam 1: De Helse Jacht Op De Duistere Nacht

source: Pajama Sam 2: Thunder and Lightning Aren't so Frightening
nl_nl: Pajama Sam 2: Doe Niet Onder Voor Bliksem En Donder

source: Pajama Sam 3: You Are What You Eat From Your Head to Your Feet
nl_nl: Pajama Sam 3: Je Bent Wat Je Eet, 't Is Maar Dat Je Het Weet

source: Pajama Sam's Lost & Found
nl_nl: Pajama Sams Verloren Voorwerpen

source: Pajama Sam's Sock Works
nl_nl: Pajama Sams Sokkensoep

source: SPY Fox 1: Dry Cereal
nl_nl: SPY Fox 1: Operatie "Melk Weg"

source: SPY Fox 2: Some Assembly Required
nl_nl: SPY Fox 2: Operatie Robot-Knop

source: Let's Explore the Farm with Buzzy
nl_nl: Ontdek De Boerderij Met Barabas De Boekenbij

source: Let's Explore the Airport with Buzzy
nl_nl: Ontdek De Luchthaven Met Barabas De Boekenbij
